cask_args appdir: '/Applications'

tap 'homebrew/bundle'
#tap 'puma/puma'

brew 'ack'
brew 'coreutils'
#brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
#brew 'libcaca', args: ['with-imlib2']
#brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
#brew 'postgresql'
#brew 'puma/puma/puma-dev'
#brew 'ruby-build'
#brew 'rbenv'
#brew 'roundup'
#brew 'spaceman-diff'
brew 'spark'
#brew 'unrar'
brew 'wget'
#brew 'yarn'
brew 'youtube-dl'

brew 'awscli'
brew 'ffmpeg'
brew 'httpie'
brew 'mas'
brew 'mtr'
brew 'python'
brew 'r'
brew 'telnet'
brew 'tree'
brew 'watch'
brew 'z'

#cask '1password'
#cask 'adium'
#cask 'atom'
#cask 'firefox'
#cask 'garmin-express'
cask 'google-chrome'
#cask 'handbrake'
#cask 'mapbox-studio'
#cask 'seashore'
#cask 'slack'
#cask 'steam'
#cask 'transmission'
#cask 'tunnelbear'
cask 'visual-studio-code'
cask 'vlc'

cask 'alfred'
cask 'anaconda'
cask 'angry-ip-scanner'
#cask 'caffeine'
cask 'cyberduck'
cask 'docker'
cask 'go2shell'
#cask 'google-backup-and-sync'
cask 'iterm2'
cask 'java'
cask 'keepassx'
cask 'microsoft-teams'
cask 'notion'
cask 'postman'
cask 'pycharm'
cask 'rstudio'
cask 'screen'
cask 'skitch'
#cask 'skype'
cask 'slack'
cask 'spotify'
cask 'teamviewer'
cask 'the-unarchiver'
#cask 'vagrant'
cask 'vanilla'
#cask 'vagrant-manager'
#cask 'virtualbox'
#cask 'virtualbox-extension-pack'
#cask 'winbox'
cask 'zoomus'

#mas 'Slack', id: 803453959
mas 'LINE', id: 539883307
mas 'Pixelmator', id: 407963104
#mas 'Microsoft Remote Desktop', id: 715768417
mas 'Microsoft Remote Desktop 10', id: 1295203466
#mas 'Telegram', id: 747648890
mas 'Amphetamine', id: 937984704
mas 'Magnet', id: 441258766
#mas 'The Unarchiver', id: 425424353
mas 'Todoist', id: 585829637

