# vim: commentstring=#\ %s

cask_args appdir: '/Applications'

# Tap Repo
# tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
# tap 'homebrew/bundle'
# tap 'mas-cli/tap'

# tap 'shellspec/shellspec'
# tap 'argoproj/tap'
# tap 'boz/repo'
# tap 'robscott/tap'
# tap 'aquasecurity/trivy'

brew 'ack'
brew 'awscli'
brew 'blueutil'
brew 'bmon'
brew 'cheat'
brew 'coreutils'
brew 'docker'
brew 'docker-compose'
brew 'eksctl'
brew 'exiftool'
brew 'ffmpeg'
brew 'fzf'
brew 'git-lfs'
brew 'go'
brew 'grc'
brew 'htop'
brew 'httpie'
brew 'iftop'
brew 'jp2a'
brew 'jq'
brew 'krew'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'mas'
# brew 'mongodb-community-shell'
brew 'mtr'
# brew 'mysql-client'
brew 'node'
brew 'nvm'
brew 'python3'
brew 'pwgen'
brew 'switchaudio-osx'
brew 'telnet'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'yarn'
brew 'youtubedr'
brew 'z'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'yqrashawn/goku/goku'

# brew 'ag'
# brew 'ansible-lint'
# brew 'argocd'
# brew 'asdf'
# brew 'aws-iam-authenticator'
# brew 'bash-completion'
# brew 'brotli'
# brew 'checkov'
# brew 'choose-rust'
# brew 'dependency-check'
# brew 'dive'
# brew 'e2fsprogs'
# brew 'fastlane'
# brew 'fd'
# brew 'git'
# brew 'git-flow'
# brew 'gitleaks'
# brew 'gnu-tar'
# brew 'gnupg'
# brew 'golangci-lint'
# brew 'hadolint'
# brew 'infracost'
# brew 'k6'
# brew 'kube-capacity'
# brew 'kube-linter'
# brew 'kubectl-argo-rollouts'
# brew 'kubernetes-helm'
# brew 'kubeseal'
# brew 'kustomize'
# brew 'lima'
# brew 'maven'
# brew 'mosh'
# brew 'mysql'
# brew 'ncdu'
# brew 'postgresql'
# brew 'pre-commit'
# brew 'rbenv'
# brew 'shellcheck'
# brew 'shellspec'
# brew 'shfmt'
# brew 'sql-lint'
# brew 'terraform'
# brew 'terraform-docs'
# brew 'terrascan'
# brew 'tflint'
# brew 'tfsec'
# brew 'the_silver_searcher'
# brew 'trash-cli'
# brew 'trivy'
# brew 'websocat'
# brew 'xml2'
# brew 'yamllint'
# brew 'yq'
# brew 'zsh'

cask 'adobe-creative-cloud'
cask 'angry-ip-scanner'
cask 'anydesk'
cask 'appcleaner'
cask 'betterdisplay'
cask 'brave-browser'
cask 'browserosaurus'
cask 'clickup'
cask 'contexts'
cask 'cyberduck'
cask 'dbeaver-community'
# cask 'discord'
# cask 'docker'
cask 'enpass'
# cask 'exifcleaner'
cask 'fantastical'
cask 'firefox'
cask 'font-fira-code'
cask 'font-hack-nerd-font'
cask 'foxitreader'
cask 'garmin-express'
# cask 'google-chat'
cask 'google-chrome'
cask 'google-cloud-sdk'
# cask 'google-drive'
cask 'go2shell'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keepassxc'
cask 'keybase'
cask 'lens'
cask 'logi-options-plus'
# cask 'microsoft-teams'
# cask 'notion'
cask 'obsidian'
# cask 'openvpn-connect'
# cask 'plex'
# cask 'postman'
cask 'prettyclean'
# cask 'pycharm'
cask 'rancher'
cask 'raycast'
cask 'rectangle-pro'
# cask 'scroll-reverser'
cask 'send-to-kindle'
cask 'skitch'
cask 'slack'
cask 'teamviewer'
cask 'telegram-desktop'
cask 'termius'
# cask 'the-unarchiver'
cask 'vanilla'
cask 'visual-studio-code'
cask 'vivaldi'
cask 'vlc'
cask 'warp'
# cash 'wechat'
# cash 'whatsapp'
# cask 'zoom'

# # Quick Look Plugins (https://github.com/sindresorhus/quick-look-plugins)
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
# cask 'suspicious-package'
# cask 'apparency'
# cask 'quicklookase'
cask 'qlvideo'

# cask 'alfred'
# cask 'authy'
# cask 'charles'
# cask 'datagrip'
# cask 'dotnet-sdk'
# cask 'figma'
# cask 'macfuse'
# cask 'miro'
# cask 'monitorcontrol'
# cask 'proxyman'
# cask 'sourcetree'
