cask_args appdir: '/Applications'

tap 'homebrew/bundle'
#tap 'puma/puma'

brew 'ack'
brew 'coreutils'
#brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
#brew 'libcaca', args: ['with-imlib2']
#brew 'libgit2'
brew 'openssl'
#brew 'node'
brew 'readline'
#brew 'postgresql'
#brew 'puma/puma/puma-dev'
#brew 'ruby-build'
#brew 'rbenv'
#brew 'roundup'
#brew 'spaceman-diff'
brew 'spark'
#brew 'unrar'
brew 'wget'
#brew 'yarn'
brew 'youtube-dl'

brew 'httpie'
brew 'mas'
brew 'mtr'
brew 'python'
brew 'tree'
brew 'watch'
brew 'z'

#cask '1password'
#cask 'adium'
cask 'atom'
cask 'firefox'
#cask 'garmin-express'
cask 'google-chrome'
#cask 'handbrake'
#cask 'mapbox-studio'
#cask 'seashore'
##cask 'slack'
#cask 'steam'
#cask 'transmission'
#cask 'tunnelbear'
cask 'vlc'

cask 'alfred'
cask 'angry-ip-scanner'
cask 'caffeine'
cask 'chromecast'
cask 'cyberduck'
cask 'docker'
cask 'google-drive'
cask 'iterm2'
cask 'keepassx'
cask 'skype'
cask 'sourcetree'
cask 'teamviewer'
cask 'the-unarchiver'
cask 'virtualbox'
cask 'winbox'

mas 'Slack',803453959
mas 'LINE',539883307
mas 'Pixelmator',407963104
mas 'Microsoft Remote Desktop',715768417
mas 'Telegram',747648890
